src/2024-09-08-nixify-emacs.org
#+TITLE: Nixify your Emacs
#+DATE: <2024-09-14 Sat>

* Nix + Emacs

Nix が流行っています。僕は 1 年半 NixOS を使っていますが、僅か 1 週間で完全に抜き去られました。インテリだ〜〜。この波に乗って Nix のパワーユーザを目指します。

** やりたいこと

今一番面白い [[https://github.com/takeokunn/nixos-configuration][takeokunn/nixos-configuration]] を参考に、 Emacs パッケージを Nix で管理してみます。これでパッケージのバージョン固定や rollback が可能になるはずです。反面、エディタの更新に =nixos-rebuild= が必要になって面倒……ということもなく、 Nix 化されていないパッケージは従来どおり =elpa/= に保存されます。

** 先に結論

進捗は以下のコミットです。ほぼ変更無しで Emacs パッケージを Nix 化できます。

- [[https://github.com/toyboot4e/dotfiles/commit/10181af8ede15d14d0aa77a6afd6b04c719b63ab][nixify your emacs]]
  [[https://github.com/nix-community/emacs-overlay][emacs-overlay]] により依存パッケージが自動的に Nix 化されました。
- [[https://github.com/toyboot4e/dotfiles/commit/7bbdc9deff22a73b718982620b56c8a94110a473][introduce =nvfetcher=]]
  =nixpkgs= に無いパッケージを =melpaBuild= でビルドし、更新には [[https://github.com/berberman/nvfetcher][nvfetcher]] を使う方法を確認しました。

* ファイル分割を読む

[[https://github.com/takeokunn/nixos-configuration][takeokunn/nixos-configuration]] を読んで基本的な Nix Flakes を学びます。

** =nvfetcher.toml=

[[https://github.com/berberman/nvfetcher][nvfetcher]] は =nvfetcher.toml= を元に [[https://nixos.wiki/wiki/Nix_Hash][hash 値]] の集まりを生成します。最新のソースを表す hash 値への更新がコマンド 1 つで実施できる点が便利です。

=nixpkgs= に登録されていないパッケージは =nvfetcher.toml= に記載し、自分でビルドする方針のようです。詳しくは後ほど紹介します。

*** =flake.nix=

設定ファイルを読んでいきます。 NixOS, macOS に両対応しています。

#+CAPTION: =flake.nix= (抜粋)
#+BEGIN_SRC nix
{
  inputs = { # (ref:1)
    nixpkgs.url = "github:NixOS/nixpkgs/nixpkgs-unstable";
    nixpkgs-stable.url = "github:nixos/nixpkgs/nixos-24.05";
    # Emacs の HEAD ビルド等ができる `overlay`.
    emacs-overlay = {
      url = "github:nix-community/emacs-overlay";
      inputs.nixpkgs.follows = "nixpkgs";
      inputs.nixpkgs-stable.follows = "nixpkgs-stable";
    };
    # `org-babel-tangle` の Nix 式による実装 (すごい)
    org-babel.url = "github:emacs-twist/org-babel";
  };
  outputs = { self, nixpkgs, home-manager, org-babel, emacs-overlay, ... }: { # (ref:2)
      # macOS における設定
      darwinConfigurations = (import ./hosts/OPL2212-2 {
        inherit self nixpkgs nix-darwin home-manager org-babel emacs-overlay
          wezterm-flake neovim-nightly-overlay;
      });
      # NixOS における設定
      nixosConfigurations = (import ./hosts/X13Gen2 { # (ref:3)
        inherit self nixpkgs home-manager org-babel emacs-overlay; # (ref:4)
      });
    };
}
#+END_SRC

- [[(1)]] [[https://nixos-and-flakes.thiscute.world/other-usage-of-flakes/inputs][=inputs=]] ~= { .. };~
  =flake.nix= の入力 (依存)を書きます。
- [[(2)]] [[https://nixos-and-flakes.thiscute.world/other-usage-of-flakes/outputs][=outputs=]] ~= {self, .. }: { .. };~
  =flake.nix= の出力を関数の形で書きます。 [[https://nixos-and-flakes.thiscute.world/nixos-with-flakes/nixos-flake-configuration-explained#special-parameter-self-of-outputs-function][=self= は =outputs= 自身を指す]] 自己参照ですが、以降の使用は無さそうです。
- [[(3)]] ~nixosConfigurations = (import ./hosts/X13Gen2) { .. })~
  - [[https://nix.dev/tutorials/nix-language.html#import][=import=]] ~./hosts/X13Gen2 { .. };~
    =import ./hosts/X13Gen2/default.nix { .. };= と等価です。 =default.nix= の内容 (後述) は関数であるため、直後に引数として attribute set ={ .. }= を与えています。
  - [[(4)]] [[https://nix.dev/manual/nix/2.18/language/constructs#inheriting-attributes][={ inherit x y z; }=]]
    ~{ x = x; y = y; z = z; }~ と等価です。常時 =inherit= されてほしかったですが、 Nix も古い言語なので仕方がありません。

