2024-09-08-nixify-emacs.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Nixify your Emacs - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>Nixify your Emacs</h1>
      <p>Sep 14, 2024</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="Nix + Emacs"><a href="#Nix + Emacs">Nix + Emacs</a></h2>
      <p>
        Nix が流行っています。僕は 1 年半 NixOS を使っていますが、僅か 1
        週間で完全に抜き去られました。インテリだ〜〜。この波に乗って Nix
        のパワーユーザを目指します。<br />
      </p>
      <h3 id="やりたいこと"><a href="#やりたいこと">やりたいこと</a></h3>
      <p>
        今一番面白い
        <a href="https://github.com/takeokunn/nixos-configuration">takeokunn/nixos-configuration</a>
        を参考に、 Emacs パッケージを Nix で管理してみます。これでパッケージのバージョン固定や
        rollback が可能になるはずです。反面、エディタの更新に
        <code>nixos-rebuild</code> が必要になって面倒……ということもなく、 Nix
        化されていないパッケージは従来どおり <code>elpa/</code> に保存されます。<br />
      </p>
      <h3 id="先に結論"><a href="#先に結論">先に結論</a></h3>
      <p>進捗は以下のコミットです。ほぼ変更無しで Emacs パッケージを Nix 化できます。<br /></p>

      <ul>
        <li>
          <a
            href="https://github.com/toyboot4e/dotfiles/commit/10181af8ede15d14d0aa77a6afd6b04c719b63ab"
            >nixify your emacs</a
          ><br />
          <a href="https://github.com/nix-community/emacs-overlay">emacs-overlay</a>
          により依存パッケージが自動的に Nix 化されました。<br />
        </li>
        <li>
          <a
            href="https://github.com/toyboot4e/dotfiles/commit/7bbdc9deff22a73b718982620b56c8a94110a473"
            >introduce <code>nvfetcher</code></a
          ><br />
          <code>nixpkgs</code> に無いパッケージを <code>melpaBuild</code> でビルドし、更新には
          <code>nvfetcher</code> を使う方法を確認しました。<br />
        </li>
      </ul>
      <h2 id="ファイル分割を読む"><a href="#ファイル分割を読む">ファイル分割を読む</a></h2>
      <p>
        <a href="https://github.com/takeokunn/nixos-configuration">takeokunn/nixos-configuration</a>
        を読んで基本的な Nix Flakes を学びます。<br />
      </p>
      <h3 id="nvfetcher.toml">
        <a href="#nvfetcher.toml"><code>nvfetcher.toml</code></a>
      </h3>
      <p>
        <a href="https://github.com/berberman/nvfetcher">nvfetcher</a> は
        <code>nvfetcher.toml</code> を元に
        <a href="https://nixos.wiki/wiki/Nix_Hash">hash 値</a>
        の集まりを生成します。最新のソースを表す hash 値への更新がコマンド 1
        つで実施できる点が便利です。<br />
      </p>

      <p>
        <code>nixpkgs</code> に登録されていないパッケージは
        <code>nvfetcher.toml</code>
        に記載し、自分でビルドする方針のようです。詳しくは後ほど紹介します。<br />
      </p>
      <h4 id="flake.nix">
        <a href="#flake.nix"><code>flake.nix</code></a>
      </h4>
      <p>設定ファイルを読んでいきます。 NixOS, macOS に両対応しています。<br /></p>

      <div class="org-src-container">
        <label class="org-src-name"
          ><span class="listing-number">Listing 1: </span><code>flake.nix</code> (抜粋)</label
        >
        <pre><code class="src language-nix">{
<span id="coderef-1-1" onmouseover="CodeHighlightOn(this,'jump-coderef-1-1');" onmouseout="CodeHighlightOff(this,'jump-coderef-1-1');" class="coderef-off"><a href="#coderef-1-1">  inputs = { # <span class="coderef-anchor">1</span></a></span>
    nixpkgs.url = "github:NixOS/nixpkgs/nixpkgs-unstable";
    nixpkgs-stable.url = "github:nixos/nixpkgs/nixos-24.05";
    # Emacs の HEAD ビルド等ができる `overlay`.
    emacs-overlay = {
      url = "github:nix-community/emacs-overlay";
      inputs.nixpkgs.follows = "nixpkgs";
      inputs.nixpkgs-stable.follows = "nixpkgs-stable";
    };
    # `org-babel-tangle` の Nix 式による実装 (すごい)
    org-babel.url = "github:emacs-twist/org-babel";
  };
<span id="coderef-1-2" onmouseover="CodeHighlightOn(this,'jump-coderef-1-2');" onmouseout="CodeHighlightOff(this,'jump-coderef-1-2');" class="coderef-off"><a href="#coderef-1-2">  # <span class="coderef-anchor">2</span></a></span>
  outputs = { self, nixpkgs, home-manager, org-babel, emacs-overlay, ... }: {
      # macOS における設定
      darwinConfigurations = (import ./hosts/OPL2212-2 {
        inherit self nixpkgs nix-darwin home-manager org-babel emacs-overlay
          wezterm-flake neovim-nightly-overlay;
      });
      # NixOS における設定
<span id="coderef-1-3" onmouseover="CodeHighlightOn(this,'jump-coderef-1-3');" onmouseout="CodeHighlightOff(this,'jump-coderef-1-3');" class="coderef-off"><a href="#coderef-1-3">      nixosConfigurations = (import ./hosts/X13Gen2 { # <span class="coderef-anchor">3</span></a></span>
<span id="coderef-1-4" onmouseover="CodeHighlightOn(this,'jump-coderef-1-4');" onmouseout="CodeHighlightOff(this,'jump-coderef-1-4');" class="coderef-off"><a href="#coderef-1-4">        inherit self nixpkgs home-manager org-babel emacs-overlay; # <span class="coderef-anchor">4</span></a></span>
      });
    };
}
</code></pre>
      </div>

      <ul>
        <li>
          <a
            href="#coderef-1-1"
            id="jump-coderef-1-1"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-1-1');"
            onmouseout="CodeHighlightOff(this, 'coderef-1-1');"
            ><span class="coderef-anchor">1</span></a
          >
          <a href="https://nixos-and-flakes.thiscute.world/other-usage-of-flakes/inputs"
            ><code>inputs</code></a
          >
          <code>= { .. };</code><br />
          <code>flake.nix</code> の入力 (依存)を書きます。<br />
        </li>
        <li>
          <a
            href="#coderef-1-2"
            id="jump-coderef-1-2"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-1-2');"
            onmouseout="CodeHighlightOff(this, 'coderef-1-2');"
            ><span class="coderef-anchor">2</span></a
          >
          <a href="https://nixos-and-flakes.thiscute.world/other-usage-of-flakes/outputs"
            ><code>outputs</code></a
          >
          <code>= {self, .. }: { .. };</code><br />
          <code>flake.nix</code> の出力を関数の形で書きます。
          <a
            href="https://nixos-and-flakes.thiscute.world/nixos-with-flakes/nixos-flake-configuration-explained#special-parameter-self-of-outputs-function"
            ><code>self</code> は <code>outputs</code> 自身を指す</a
          >
          自己参照ですが、以降の使用は無さそうです。<br />
        </li>
        <li>
          <a
            href="#coderef-1-3"
            id="jump-coderef-1-3"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-1-3');"
            onmouseout="CodeHighlightOff(this, 'coderef-1-3');"
            ><span class="coderef-anchor">3</span></a
          >
          <code>nixosConfigurations = (import ./hosts/X13Gen2) { .. })</code><br />
          <ul>
            <li>
              <a href="https://nix.dev/tutorials/nix-language.html#import"><code>import</code></a>
              <code>./hosts/X13Gen2 { .. };</code><br />
              <code>import ./hosts/X13Gen2/default.nix { .. };</code> と等価です。
              <code>default.nix</code> の内容 (後述) は関数であるため、直後に引数として attribute
              set <code>{ .. }</code> を与えています。<br />
            </li>
            <li>
              <a
                href="#coderef-1-4"
                id="jump-coderef-1-4"
                class="coderef"
                onmouseover="CodeHighlightOn(this,'coderef-1-4');"
                onmouseout="CodeHighlightOff(this, 'coderef-1-4');"
                ><span class="coderef-anchor">4</span></a
              >
              <a href="https://nix.dev/manual/nix/2.18/language/constructs#inheriting-attributes"
                ><code>{ inherit x y z; }</code></a
              ><br />
              <code>{ x = x; y = y; z = z; }</code> と等価です。常時
              <code>inherit</code> されてほしかったですが、 Nix
              も古い言語なので仕方がありません。<br />
            </li>
          </ul>
        </li>
      </ul>
