src/2024-09-08-nixify-emacs.org
** =home-manager/programs/emacs/default.nix=

[[https://github.com/nix-community/emacs-overlay][emacs-overlay]] を使用しています。

#+BEGIN_SRC nix
{ pkgs, org-babel, sources }:
let tangle = org-babel.lib.tangleOrgBabel { languages = [ "emacs-lisp" ]; }; # (ref:1)
in {
  programs.emacs = { # (ref:2)
    enable = true;
    package = pkgs.emacsWithPackagesFromUsePackage { # (ref:3)
      config = ./elisp/init.org;
      defaultInitFile = true;
      package = pkgs.emacs-git; # (ref:4)
      alwaysTangle = true;
      extraEmacsPackages = import ./epkgs { inherit pkgs sources; }; # (ref:5)
    };
  };

  home.file = { # (ref:6)
    ".config/emacs/init.el".text = tangle (builtins.readFile ./elisp/init.org);
    ".config/emacs/early-init.el".text =
      tangle (builtins.readFile ./elisp/early-init.org);
    ".config/emacs/yasnippet.org".source = ./yasnippet.org;
  };

  home.packages = with pkgs; [ emacs-lsp-booster pinentry-emacs cmigemo ];
}
#+END_SRC

- [[(1)]] [[https://github.com/emacs-twist/org-babel][emacs-twist/org-babel]] は =org-babel-tangle= の Nix 実装です (え？) 。 =$HOME= 以下に各種 =.el= を配置するため使用されています。
- [[(2)]] [[https://github.com/nix-community/home-manager/blob/503af483e1b328691ea3a434d331995595fb2e3d/modules/programs/emacs.nix][programs.emacs]] は =home-manager= 定義です。 =user.packages= と =programs= の違いとしては、 =programs= の方が追加設定を実施してくれるイメージがあります。
- [[(3)]] [[https://github.com/nix-community/emacs-overlay/blob/795d5dc72088bd6c758826c56284b0024b045194/elisp.nix][emacsWithPackagesFromUsePackage]] は [[https://github.com/nix-community/emacs-overlay][emacs-overlay]] の関数です。設定ファイル中の =use-package= / =leaf= 式をパースして、本家の =emacsWithPackages= に渡してくれるようです。
- [[(4)]] =emacs-git= は HEAD, =emacs-unstable= は latest リリースを指します。 HEAD ビルドを選択しています。
- [[(5)]] =extraEmacsPackages= で Emacs パッケージを指定しています。
- [[(6)]] [[https://github.com/emacs-twist/org-babel][emacs-twist/org-babel]] で設定ファイルを配置しています。

** =home-manager/programs/emacs/epkgs/default.nix=

これはパッケージのリストを作るだけですね。リストされたパッケージは =load-path= に入ります。

#+BEGIN_SRC nix
{ pkgs, sources }:
epkgs:
let
  ai = import ./packages/ai { inherit epkgs pkgs sources; };
  # 略
in ai ++ awesome ++ buffer ++ client ++ coding ++ cursor ++ dired ++ elfeed
++ eshell ++ eww ++ exwm ++ file ++ ime ++ language ++ language_specific
++ monitor ++ org ++ project ++ remote_access ++ themes ++ search ++ window
#+END_SRC

nixpkgs に無いパッケージは、 =nvfetcher= によりソース指定して =melpaBuild= により Nix 化しています。

#+BEGIN_SRC nix
{ sources, epkgs }: {
  rainbow-csv = epkgs.melpaBuild {
    pname = "rainbow-csv";
    version = "0.0.1";
    src = sources.emacs-rainbow-csv.src;

    packageRequires = with epkgs; [ csv-mode ];

    ignoreCompilationError = false;
  };
  ## ~~
}
#+END_SRC

……ハッ、それだけ？！　すごいエコシステムです。使い方を調べるのは非常に大変だと思いますが、今回は take さんに便乗できて楽できました。今後もフォースペンギンぐらいの歩き方をして行こうかなと……。

* 備考: =nvfetcher= の使い方

[[https://github.com/tacit7/smyx/pull/14][=smyx= への修正]] マージまでの間、 fork を =nvfetcher= 経由で使ってみることにしました。

#+BEGIN_QUOTE
もちろん =straight= や =elpaca= を使っても良いです。
#+END_QUOTE

** =source= を作成する

以下の =nvfetcher.toml= にリポジトリの一覧を記載します:

#+CAPTION: =nvfetcher.toml=
#+BEGIN_SRC toml
[emacs-smyx]
src.git = "https://github.com/toyboot4e/smyx"
src.branch = "master"
fetch.github = "toyboot4e/smyx"
#+END_SRC

=nvfetcher= コマンドで =.nix= を生成します:

#+BEGIN_SRC sh
$ nvfetcher
# CheckGit
    url: https://github.com/toyboot4e/smyx
    branch: master
Changes:
emacs-smyx: ∅ → 97a2e1ef2bcffd34e43b1cabad17d317e41258ec
#+END_SRC

#+BEGIN_SRC sh
$ ls _sources/
generated.json  generated.nix
#+END_SRC

ファイル内容は次の通りです:

#+CAPTION: =_sources/generated.nix=
#+BEGIN_SRC nix
# This file was generated by nvfetcher, please do not modify it manually.
{ fetchgit, fetchurl, fetchFromGitHub, dockerTools }:
{
  emacs-smyx = {
    pname = "emacs-smyx";
    version = "97a2e1ef2bcffd34e43b1cabad17d317e41258ec";
    src = fetchFromGitHub {
      owner = "toyboot4e";
      repo = "smyx";
      rev = "97a2e1ef2bcffd34e43b1cabad17d317e41258ec";
      fetchSubmodules = false;
      sha256 = "sha256-1UZRtQ74p4xAuB6JXFHMxrNBO9BG6JPRYLvEeCOz5rc=";
    };
    date = "2024-09-14";
  };
}
#+END_SRC

