2024-09-08-nixify-emacs.html
      <h3 id="home-manager/programs/emacs/default.nix">
        <a href="#home-manager/programs/emacs/default.nix"
          ><code>home-manager/programs/emacs/default.nix</code></a
        >
      </h3>
      <p>
        <a href="https://github.com/nix-community/emacs-overlay">emacs-overlay</a>
        を使用しています。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-nix">{ pkgs, org-babel, sources }:
<span id="coderef-5-1" onmouseover="CodeHighlightOn(this,'jump-coderef-5-1');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-1');" class="coderef-off"><a href="#coderef-5-1"># <span class="coderef-anchor">1</span></a></span>
let tangle = org-babel.lib.tangleOrgBabel { languages = [ "emacs-lisp" ]; };
in {
<span id="coderef-5-2" onmouseover="CodeHighlightOn(this,'jump-coderef-5-2');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-2');" class="coderef-off"><a href="#coderef-5-2">  programs.emacs = { # <span class="coderef-anchor">2</span></a></span>
    enable = true;
<span id="coderef-5-3" onmouseover="CodeHighlightOn(this,'jump-coderef-5-3');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-3');" class="coderef-off"><a href="#coderef-5-3">    package = pkgs.emacsWithPackagesFromUsePackage { # <span class="coderef-anchor">3</span></a></span>
      config = ./elisp/init.org;
      defaultInitFile = true;
<span id="coderef-5-4" onmouseover="CodeHighlightOn(this,'jump-coderef-5-4');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-4');" class="coderef-off"><a href="#coderef-5-4">      package = pkgs.emacs-git; # <span class="coderef-anchor">4</span></a></span>
      alwaysTangle = true;
<span id="coderef-5-5" onmouseover="CodeHighlightOn(this,'jump-coderef-5-5');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-5');" class="coderef-off"><a href="#coderef-5-5">      extraEmacsPackages = import ./epkgs { inherit pkgs sources; }; # <span class="coderef-anchor">5</span></a></span>
    };
  };

<span id="coderef-5-6" onmouseover="CodeHighlightOn(this,'jump-coderef-5-6');" onmouseout="CodeHighlightOff(this,'jump-coderef-5-6');" class="coderef-off"><a href="#coderef-5-6">  home.file = { # <span class="coderef-anchor">6</span></a></span>
    ".config/emacs/init.el".text = tangle (builtins.readFile ./elisp/init.org);
    ".config/emacs/early-init.el".text =
      tangle (builtins.readFile ./elisp/early-init.org);
    ".config/emacs/yasnippet.org".source = ./yasnippet.org;
  };

  home.packages = with pkgs; [ emacs-lsp-booster pinentry-emacs cmigemo ];
}
</code></pre>
      </div>

      <ul>
        <li>
          <a
            href="#coderef-5-1"
            id="jump-coderef-5-1"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-1');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-1');"
            ><span class="coderef-anchor">1</span></a
          >
          <a href="https://github.com/emacs-twist/org-babel">emacs-twist/org-babel</a> は
          <code>org-babel-tangle</code> の Nix 実装です (え？) 。 <code>$HOME</code> 以下に各種
          <code>.el</code> を配置するため使用されています。<br />
        </li>
        <li>
          <a
            href="#coderef-5-2"
            id="jump-coderef-5-2"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-2');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-2');"
            ><span class="coderef-anchor">2</span></a
          >
          <a
            href="https://github.com/nix-community/home-manager/blob/503af483e1b328691ea3a434d331995595fb2e3d/modules/programs/emacs.nix"
            >programs.emacs</a
          >
          は <code>home-manager</code> 定義です。 <code>user.packages</code> と
          <code>programs</code> の違いとしては、
          <code>programs</code> の方が追加設定を実施してくれるイメージがあります。<br />
        </li>
        <li>
          <a
            href="#coderef-5-3"
            id="jump-coderef-5-3"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-3');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-3');"
            ><span class="coderef-anchor">3</span></a
          >
          <a
            href="https://github.com/nix-community/emacs-overlay/blob/795d5dc72088bd6c758826c56284b0024b045194/elisp.nix"
            >emacsWithPackagesFromUsePackage</a
          >
          は
          <a href="https://github.com/nix-community/emacs-overlay">emacs-overlay</a>
          の関数です。設定ファイル中の <code>use-package</code> /
          <code>leaf</code> 式をパースして、本家の
          <code>emacsWithPackages</code> に渡してくれるようです。<br />
        </li>
        <li>
          <a
            href="#coderef-5-4"
            id="jump-coderef-5-4"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-4');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-4');"
            ><span class="coderef-anchor">4</span></a
          >
          <code>emacs-git</code> は HEAD, <code>emacs-unstable</code> は latest リリースを指します。
          HEAD ビルドを選択しています。<br />
        </li>
        <li>
          <a
            href="#coderef-5-5"
            id="jump-coderef-5-5"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-5');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-5');"
            ><span class="coderef-anchor">5</span></a
          >
          <code>extraEmacsPackages</code> で Emacs パッケージを指定しています。<br />
        </li>
        <li>
          <a
            href="#coderef-5-6"
            id="jump-coderef-5-6"
            class="coderef"
            onmouseover="CodeHighlightOn(this,'coderef-5-6');"
            onmouseout="CodeHighlightOff(this, 'coderef-5-6');"
            ><span class="coderef-anchor">6</span></a
          >
          <a href="https://github.com/emacs-twist/org-babel">emacs-twist/org-babel</a>
          で設定ファイルを配置しています。<br />
        </li>
      </ul>
      <h3 id="home-manager/programs/emacs/epkgs/default.nix">
        <a href="#home-manager/programs/emacs/epkgs/default.nix"
          ><code>home-manager/programs/emacs/epkgs/default.nix</code></a
        >
      </h3>
      <p>
        これはパッケージのリストを作るだけですね。リストされたパッケージは
        <code>load-path</code> に入ります。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-nix">{ pkgs, sources }:
epkgs:
let
  ai = import ./packages/ai { inherit epkgs pkgs sources; };
  # 略
in ai ++ awesome ++ buffer ++ client ++ coding ++ cursor ++ dired ++ elfeed
++ eshell ++ eww ++ exwm ++ file ++ ime ++ language ++ language_specific
++ monitor ++ org ++ project ++ remote_access ++ themes ++ search ++ window
</code></pre>
      </div>

      <p>
        nixpkgs に無いパッケージは、 <code>nvfetcher</code> によりソース指定して
        <code>melpaBuild</code> により Nix 化しています。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-nix">{ sources, epkgs }: {
  rainbow-csv = epkgs.melpaBuild {
    pname = "rainbow-csv";
    version = "0.0.1";
    src = sources.emacs-rainbow-csv.src;

    packageRequires = with epkgs; [ csv-mode ];

    ignoreCompilationError = false;
  };
  ## ~~
}
</code></pre>
      </div>

      <p>
        ……ハッ、それだけ？！　すごいエコシステムです。使い方を調べるのは非常に大変だと思いますが、今回は
        take
        さんに便乗できて楽できました。今後もフォースペンギンぐらいの歩き方をして行こうかなと……。<br />
      </p>
      <h2 id="備考: nvfetcher の使い方">
        <a href="#備考: nvfetcher の使い方">備考: <code>nvfetcher</code> の使い方</a>
      </h2>
      <p>
        <a href="https://github.com/tacit7/smyx/pull/14"><code>smyx</code> への修正</a>
        マージまでの間、 fork を <code>nvfetcher</code> 経由で使ってみることにしました。<br />
      </p>

      <blockquote>
        <p>もちろん <code>straight</code> や <code>elpaca</code> を使っても良いです。<br /></p>
      </blockquote>
      <h3 id="source を作成する">
        <a href="#source を作成する"><code>source</code> を作成する</a>
      </h3>
      <p>以下の <code>nvfetcher.toml</code> にリポジトリの一覧を記載します:<br /></p>

      <div class="org-src-container">
        <label class="org-src-name"
          ><span class="listing-number">Listing 5: </span><code>nvfetcher.toml</code></label
        >
        <pre><code class="src language-toml">[emacs-smyx]
src.git = "https://github.com/toyboot4e/smyx"
src.branch = "master"
fetch.github = "toyboot4e/smyx"
</code></pre>
      </div>

      <p><code>nvfetcher</code> コマンドで <code>.nix</code> を生成します:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-sh">$ nvfetcher
# CheckGit
    url: https://github.com/toyboot4e/smyx
    branch: master
Changes:
emacs-smyx: ∅ → 97a2e1ef2bcffd34e43b1cabad17d317e41258ec
</code></pre>
      </div>

      <div class="org-src-container">
        <pre><code class="src language-sh">$ ls _sources/
generated.json  generated.nix
</code></pre>
      </div>

      <p>ファイル内容は次の通りです:<br /></p>

      <div class="org-src-container">
        <label class="org-src-name"
          ><span class="listing-number">Listing 6: </span><code>_sources/generated.nix</code></label
        >
        <pre><code class="src language-nix"># This file was generated by nvfetcher, please do not modify it manually.
{ fetchgit, fetchurl, fetchFromGitHub, dockerTools }:
{
  emacs-smyx = {
    pname = "emacs-smyx";
    version = "97a2e1ef2bcffd34e43b1cabad17d317e41258ec";
    src = fetchFromGitHub {
      owner = "toyboot4e";
      repo = "smyx";
      rev = "97a2e1ef2bcffd34e43b1cabad17d317e41258ec";
      fetchSubmodules = false;
      sha256 = "sha256-1UZRtQ74p4xAuB6JXFHMxrNBO9BG6JPRYLvEeCOz5rc=";
    };
    date = "2024-09-14";
  };
}
</code></pre>
      </div>
